NextFOAM-2409/tutorials/multiphase/interIsoFoam/iobasin/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type    zeroGradient;
    }

    walls
    {
        type    fixedFluxPressure;
        value   uniform 0;
    }

    outlet
    {
        type    zeroGradient;
    }

    atmosphere
    {
        type    totalPressure;
        p0      uniform 0;
    }
}

// ************************************************************************* //
